stm32duino/VL53L1/src/vl53l1_register_map.h

/*******************************************************************************
 * Copyright (c) 2020, STMicroelectronics - All Rights Reserved

 This file is part of VL53L1 Core and is dual licensed,
 either 'STMicroelectronics
 Proprietary license'
 or 'BSD 3-clause "New" or "Revised" License' , at your option.

********************************************************************************

 'STMicroelectronics Proprietary license'

********************************************************************************

 License terms: STMicroelectronics Proprietary in accordance with licensing
 terms at www.st.com/sla0081

 STMicroelectronics confidential
 Reproduction and Communication of this document is strictly prohibited unless
 specifically authorized in writing by STMicroelectronics.


********************************************************************************

 Alternatively, VL53L1 Core may be distributed under the terms of
 'BSD 3-clause "New" or "Revised" License', in which case the following
 provisions apply instead of the ones
 mentioned above :

********************************************************************************

 License terms: BSD 3-clause "New" or "Revised" License.

 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions are met:

 1. Redistributions of source code must retain the above copyright notice, this
 list of conditions and the following disclaimer.

 2. Redistributions in binary form must reproduce the above copyright notice,
 this list of conditions and the following disclaimer in the documentation
 and/or other materials provided with the distribution.

 3. Neither the name of the copyright holder nor the names of its contributors
 may be used to endorse or promote products derived from this software
 without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.


********************************************************************************

*/




#ifndef _VL53L1_REGISTER_MAP_H_
#define _VL53L1_REGISTER_MAP_H_



#define VL53L1_SOFT_RESET 0x0000

#define VL53L1_I2C_SLAVE__DEVICE_ADDRESS 0x0001

#define VL53L1_ANA_CONFIG__VHV_REF_SEL_VDDPIX 0x0002

#define VL53L1_ANA_CONFIG__VHV_REF_SEL_VQUENCH 0x0003

#define VL53L1_ANA_CONFIG__REG_AVDD1V2_SEL 0x0004

#define VL53L1_ANA_CONFIG__FAST_OSC__TRIM 0x0005

#define VL53L1_OSC_MEASURED__FAST_OSC__FREQUENCY 0x0006

#define VL53L1_OSC_MEASURED__FAST_OSC__FREQUENCY_HI 0x0006

#define VL53L1_OSC_MEASURED__FAST_OSC__FREQUENCY_LO 0x0007

#define VL53L1_VHV_CONFIG__TIMEOUT_MACROP_LOOP_BOUND 0x0008

#define VL53L1_VHV_CONFIG__COUNT_THRESH 0x0009

#define VL53L1_VHV_CONFIG__OFFSET 0x000A

#define VL53L1_VHV_CONFIG__INIT 0x000B

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_0 0x000D

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_1 0x000E

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_2 0x000F

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_3 0x0010

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_4 0x0011

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_REF_5 0x0012

#define VL53L1_GLOBAL_CONFIG__REF_EN_START_SELECT 0x0013

#define VL53L1_REF_SPAD_MAN__NUM_REQUESTED_REF_SPADS 0x0014

#define VL53L1_REF_SPAD_MAN__REF_LOCATION 0x0015

#define VL53L1_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS 0x0016

#define VL53L1_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS_HI 0x0016

#define VL53L1_ALGO__CROSSTALK_COMPENSATION_PLANE_OFFSET_KCPS_LO 0x0017

#define VL53L1_ALGO__CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS 0x0018

#define VL53L1_ALGO__CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS_HI 0x0018

#define VL53L1_ALGO__CROSSTALK_COMPENSATION_X_PLANE_GRADIENT_KCPS_LO 0x0019

#define VL53L1_ALGO__CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS 0x001A

#define VL53L1_ALGO__CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS_HI 0x001A

#define VL53L1_ALGO__CROSSTALK_COMPENSATION_Y_PLANE_GRADIENT_KCPS_LO 0x001B

#define VL53L1_REF_SPAD_CHAR__TOTAL_RATE_TARGET_MCPS 0x001C

#define VL53L1_REF_SPAD_CHAR__TOTAL_RATE_TARGET_MCPS_HI 0x001C

#define VL53L1_REF_SPAD_CHAR__TOTAL_RATE_TARGET_MCPS_LO 0x001D

#define VL53L1_ALGO__PART_TO_PART_RANGE_OFFSET_MM 0x001E

#define VL53L1_ALGO__PART_TO_PART_RANGE_OFFSET_MM_HI 0x001E

#define VL53L1_ALGO__PART_TO_PART_RANGE_OFFSET_MM_LO 0x001F

#define VL53L1_MM_CONFIG__INNER_OFFSET_MM 0x0020

#define VL53L1_MM_CONFIG__INNER_OFFSET_MM_HI 0x0020

#define VL53L1_MM_CONFIG__INNER_OFFSET_MM_LO 0x0021

#define VL53L1_MM_CONFIG__OUTER_OFFSET_MM 0x0022

#define VL53L1_MM_CONFIG__OUTER_OFFSET_MM_HI 0x0022

#define VL53L1_MM_CONFIG__OUTER_OFFSET_MM_LO 0x0023

#define VL53L1_DSS_CONFIG__TARGET_TOTAL_RATE_MCPS 0x0024

#define VL53L1_DSS_CONFIG__TARGET_TOTAL_RATE_MCPS_HI 0x0024

#define VL53L1_DSS_CONFIG__TARGET_TOTAL_RATE_MCPS_LO 0x0025

#define VL53L1_DEBUG__CTRL 0x0026

#define VL53L1_TEST_MODE__CTRL 0x0027

#define VL53L1_CLK_GATING__CTRL 0x0028

#define VL53L1_NVM_BIST__CTRL 0x0029

#define VL53L1_NVM_BIST__NUM_NVM_WORDS 0x002A

#define VL53L1_NVM_BIST__START_ADDRESS 0x002B

#define VL53L1_HOST_IF__STATUS 0x002C

#define VL53L1_PAD_I2C_HV__CONFIG 0x002D

#define VL53L1_PAD_I2C_HV__EXTSUP_CONFIG 0x002E

#define VL53L1_GPIO_HV_PAD__CTRL 0x002F

#define VL53L1_GPIO_HV_MUX__CTRL 0x0030

#define VL53L1_GPIO__TIO_HV_STATUS 0x0031

#define VL53L1_GPIO__FIO_HV_STATUS 0x0032

