stm32duino/VL53L1/src/vl53l1_register_map.h
#define VL53L1_ANA_CONFIG__SPAD_SEL_PSWIDTH 0x0033

#define VL53L1_ANA_CONFIG__VCSEL_PULSE_WIDTH_OFFSET 0x0034

#define VL53L1_ANA_CONFIG__FAST_OSC__CONFIG_CTRL 0x0035

#define VL53L1_SIGMA_ESTIMATOR__EFFECTIVE_PULSE_WIDTH_NS 0x0036

#define VL53L1_SIGMA_ESTIMATOR__EFFECTIVE_AMBIENT_WIDTH_NS 0x0037

#define VL53L1_SIGMA_ESTIMATOR__SIGMA_REF_MM 0x0038

#define VL53L1_ALGO__CROSSTALK_COMPENSATION_VALID_HEIGHT_MM 0x0039

#define VL53L1_SPARE_HOST_CONFIG__STATIC_CONFIG_SPARE_0 0x003A

#define VL53L1_SPARE_HOST_CONFIG__STATIC_CONFIG_SPARE_1 0x003B

#define VL53L1_ALGO__RANGE_IGNORE_THRESHOLD_MCPS 0x003C

#define VL53L1_ALGO__RANGE_IGNORE_THRESHOLD_MCPS_HI 0x003C

#define VL53L1_ALGO__RANGE_IGNORE_THRESHOLD_MCPS_LO 0x003D

#define VL53L1_ALGO__RANGE_IGNORE_VALID_HEIGHT_MM 0x003E

#define VL53L1_ALGO__RANGE_MIN_CLIP 0x003F

#define VL53L1_ALGO__CONSISTENCY_CHECK__TOLERANCE 0x0040

#define VL53L1_SPARE_HOST_CONFIG__STATIC_CONFIG_SPARE_2 0x0041

#define VL53L1_SD_CONFIG__RESET_STAGES_MSB 0x0042

#define VL53L1_SD_CONFIG__RESET_STAGES_LSB 0x0043

#define VL53L1_GPH_CONFIG__STREAM_COUNT_UPDATE_VALUE 0x0044

#define VL53L1_GLOBAL_CONFIG__STREAM_DIVIDER 0x0045

#define VL53L1_SYSTEM__INTERRUPT_CONFIG_GPIO 0x0046

#define VL53L1_CAL_CONFIG__VCSEL_START 0x0047

#define VL53L1_CAL_CONFIG__REPEAT_RATE 0x0048

#define VL53L1_CAL_CONFIG__REPEAT_RATE_HI 0x0048

#define VL53L1_CAL_CONFIG__REPEAT_RATE_LO 0x0049

#define VL53L1_GLOBAL_CONFIG__VCSEL_WIDTH 0x004A

#define VL53L1_PHASECAL_CONFIG__TIMEOUT_MACROP 0x004B

#define VL53L1_PHASECAL_CONFIG__TARGET 0x004C

#define VL53L1_PHASECAL_CONFIG__OVERRIDE 0x004D

#define VL53L1_DSS_CONFIG__ROI_MODE_CONTROL 0x004F

#define VL53L1_SYSTEM__THRESH_RATE_HIGH 0x0050

#define VL53L1_SYSTEM__THRESH_RATE_HIGH_HI 0x0050

#define VL53L1_SYSTEM__THRESH_RATE_HIGH_LO 0x0051

#define VL53L1_SYSTEM__THRESH_RATE_LOW 0x0052

#define VL53L1_SYSTEM__THRESH_RATE_LOW_HI 0x0052

#define VL53L1_SYSTEM__THRESH_RATE_LOW_LO 0x0053

#define VL53L1_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT 0x0054

#define VL53L1_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_HI 0x0054

#define VL53L1_DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_LO 0x0055

#define VL53L1_DSS_CONFIG__MANUAL_BLOCK_SELECT 0x0056

#define VL53L1_DSS_CONFIG__APERTURE_ATTENUATION 0x0057

#define VL53L1_DSS_CONFIG__MAX_SPADS_LIMIT 0x0058

#define VL53L1_DSS_CONFIG__MIN_SPADS_LIMIT 0x0059

#define VL53L1_MM_CONFIG__TIMEOUT_MACROP_A_HI 0x005A

#define VL53L1_MM_CONFIG__TIMEOUT_MACROP_A_LO 0x005B

#define VL53L1_MM_CONFIG__TIMEOUT_MACROP_B_HI 0x005C

#define VL53L1_MM_CONFIG__TIMEOUT_MACROP_B_LO 0x005D

#define VL53L1_RANGE_CONFIG__TIMEOUT_MACROP_A_HI 0x005E

#define VL53L1_RANGE_CONFIG__TIMEOUT_MACROP_A_LO 0x005F

#define VL53L1_RANGE_CONFIG__VCSEL_PERIOD_A 0x0060

#define VL53L1_RANGE_CONFIG__TIMEOUT_MACROP_B_HI 0x0061

#define VL53L1_RANGE_CONFIG__TIMEOUT_MACROP_B_LO 0x0062

#define VL53L1_RANGE_CONFIG__VCSEL_PERIOD_B 0x0063

#define VL53L1_RANGE_CONFIG__SIGMA_THRESH 0x0064

#define VL53L1_RANGE_CONFIG__SIGMA_THRESH_HI 0x0064

#define VL53L1_RANGE_CONFIG__SIGMA_THRESH_LO 0x0065

#define VL53L1_RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS 0x0066

#define VL53L1_RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS_HI 0x0066

#define VL53L1_RANGE_CONFIG__MIN_COUNT_RATE_RTN_LIMIT_MCPS_LO 0x0067

#define VL53L1_RANGE_CONFIG__VALID_PHASE_LOW 0x0068

#define VL53L1_RANGE_CONFIG__VALID_PHASE_HIGH 0x0069

#define VL53L1_SYSTEM__INTERMEASUREMENT_PERIOD 0x006C

#define VL53L1_SYSTEM__INTERMEASUREMENT_PERIOD_3 0x006C

#define VL53L1_SYSTEM__INTERMEASUREMENT_PERIOD_2 0x006D

#define VL53L1_SYSTEM__INTERMEASUREMENT_PERIOD_1 0x006E

#define VL53L1_SYSTEM__INTERMEASUREMENT_PERIOD_0 0x006F

#define VL53L1_SYSTEM__FRACTIONAL_ENABLE 0x0070

#define VL53L1_SYSTEM__GROUPED_PARAMETER_HOLD_0 0x0071

#define VL53L1_SYSTEM__THRESH_HIGH 0x0072

#define VL53L1_SYSTEM__THRESH_HIGH_HI 0x0072

#define VL53L1_SYSTEM__THRESH_HIGH_LO 0x0073

#define VL53L1_SYSTEM__THRESH_LOW 0x0074

#define VL53L1_SYSTEM__THRESH_LOW_HI 0x0074

#define VL53L1_SYSTEM__THRESH_LOW_LO 0x0075

#define VL53L1_SYSTEM__ENABLE_XTALK_PER_QUADRANT 0x0076

#define VL53L1_SYSTEM__SEED_CONFIG 0x0077

#define VL53L1_SD_CONFIG__WOI_SD0 0x0078

#define VL53L1_SD_CONFIG__WOI_SD1 0x0079

#define VL53L1_SD_CONFIG__INITIAL_PHASE_SD0 0x007A

#define VL53L1_SD_CONFIG__INITIAL_PHASE_SD1 0x007B

#define VL53L1_SYSTEM__GROUPED_PARAMETER_HOLD_1 0x007C

#define VL53L1_SD_CONFIG__FIRST_ORDER_SELECT 0x007D

#define VL53L1_SD_CONFIG__QUANTIFIER 0x007E

#define VL53L1_ROI_CONFIG__USER_ROI_CENTRE_SPAD 0x007F

#define VL53L1_ROI_CONFIG__USER_ROI_REQUESTED_GLOBAL_XY_SIZE 0x0080

#define VL53L1_SYSTEM__SEQUENCE_CONFIG 0x0081

#define VL53L1_SYSTEM__GROUPED_PARAMETER_HOLD 0x0082

#define VL53L1_POWER_MANAGEMENT__GO1_POWER_FORCE 0x0083

#define VL53L1_SYSTEM__STREAM_COUNT_CTRL 0x0084

#define VL53L1_FIRMWARE__ENABLE 0x0085

#define VL53L1_SYSTEM__INTERRUPT_CLEAR 0x0086

#define VL53L1_SYSTEM__MODE_START 0x0087

#define VL53L1_RESULT__INTERRUPT_STATUS 0x0088

#define VL53L1_RESULT__RANGE_STATUS 0x0089

#define VL53L1_RESULT__REPORT_STATUS 0x008A

#define VL53L1_RESULT__STREAM_COUNT 0x008B

#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0 0x008C

#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x008C

#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x008D

#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0 0x008E

#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x008E

#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_LO 0x008F

#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0 0x0090

#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_HI 0x0090

#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_LO 0x0091

#define VL53L1_RESULT__SIGMA_SD0 0x0092

#define VL53L1_RESULT__SIGMA_SD0_HI 0x0092

#define VL53L1_RESULT__SIGMA_SD0_LO 0x0093

#define VL53L1_RESULT__PHASE_SD0 0x0094

#define VL53L1_RESULT__PHASE_SD0_HI 0x0094

#define VL53L1_RESULT__PHASE_SD0_LO 0x0095

#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0 0x0096

#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_HI 0x0096

#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_LO 0x0097

#define VL53L1_PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0 0x0098

#define VL53L1__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_HI 0x0098

#define VL53L1___PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_LO 0x0099

