stm32duino/VL53L1/src/vl53l1_register_map.h
#define VL53L1_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0 0x009A

#define VL53L1_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x009A

#define VL53L1_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x009B

#define VL53L1_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0 0x009C

#define VL53L1_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x009C

#define VL53L1_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x009D

#define VL53L1_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0 0x009E

#define VL53L1_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x009E

#define VL53L1_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_LO 0x009F

#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1 0x00A0

#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_HI 0x00A0

#define VL53L1_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_LO 0x00A1

#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1 0x00A2

#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_HI 0x00A2

#define VL53L1_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_LO 0x00A3

#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1 0x00A4

#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_HI 0x00A4

#define VL53L1_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_LO 0x00A5

#define VL53L1_RESULT__SIGMA_SD1 0x00A6

#define VL53L1_RESULT__SIGMA_SD1_HI 0x00A6

#define VL53L1_RESULT__SIGMA_SD1_LO 0x00A7

#define VL53L1_RESULT__PHASE_SD1 0x00A8

#define VL53L1_RESULT__PHASE_SD1_HI 0x00A8

#define VL53L1_RESULT__PHASE_SD1_LO 0x00A9

#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1 0x00AA

#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_HI 0x00AA

#define VL53L1_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_LO 0x00AB

#define VL53L1_RESULT__SPARE_0_SD1 0x00AC

#define VL53L1_RESULT__SPARE_0_SD1_HI 0x00AC

#define VL53L1_RESULT__SPARE_0_SD1_LO 0x00AD

#define VL53L1_RESULT__SPARE_1_SD1 0x00AE

#define VL53L1_RESULT__SPARE_1_SD1_HI 0x00AE

#define VL53L1_RESULT__SPARE_1_SD1_LO 0x00AF

#define VL53L1_RESULT__SPARE_2_SD1 0x00B0

#define VL53L1_RESULT__SPARE_2_SD1_HI 0x00B0

#define VL53L1_RESULT__SPARE_2_SD1_LO 0x00B1

#define VL53L1_RESULT__SPARE_3_SD1 0x00B2

#define VL53L1_RESULT__THRESH_INFO 0x00B3

#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0 0x00B4

#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_3 0x00B4

#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_2 0x00B5

#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_1 0x00B6

#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_0 0x00B7

#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0 0x00B8

#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_3 0x00B8

#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_2 0x00B9

#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_1 0x00BA

#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_0 0x00BB

#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0 0x00BC

#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_3 0x00BC

#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_2 0x00BD

#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_1 0x00BE

#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_0 0x00BF

#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0 0x00C0

#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_3 0x00C0

#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_2 0x00C1

#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_1 0x00C2

#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_0 0x00C3

#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1 0x00C4

#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_3 0x00C4

#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_2 0x00C5

#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_1 0x00C6

#define VL53L1_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_0 0x00C7

#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1 0x00C8

#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_3 0x00C8

#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_2 0x00C9

#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_1 0x00CA

#define VL53L1_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_0 0x00CB

#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1 0x00CC

#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_3 0x00CC

#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_2 0x00CD

#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_1 0x00CE

#define VL53L1_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_0 0x00CF

#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1 0x00D0

#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_3 0x00D0

#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_2 0x00D1

#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_1 0x00D2

#define VL53L1_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_0 0x00D3

#define VL53L1_RESULT_CORE__SPARE_0 0x00D4

#define VL53L1_PHASECAL_RESULT__REFERENCE_PHASE 0x00D6

#define VL53L1_PHASECAL_RESULT__REFERENCE_PHASE_HI 0x00D6

#define VL53L1_PHASECAL_RESULT__REFERENCE_PHASE_LO 0x00D7

#define VL53L1_PHASECAL_RESULT__VCSEL_START 0x00D8

#define VL53L1_REF_SPAD_CHAR_RESULT__NUM_ACTUAL_REF_SPADS 0x00D9

#define VL53L1_REF_SPAD_CHAR_RESULT__REF_LOCATION 0x00DA

#define VL53L1_VHV_RESULT__COLDBOOT_STATUS 0x00DB

#define VL53L1_VHV_RESULT__SEARCH_RESULT 0x00DC

#define VL53L1_VHV_RESULT__LATEST_SETTING 0x00DD

#define VL53L1_RESULT__OSC_CALIBRATE_VAL 0x00DE

#define VL53L1_RESULT__OSC_CALIBRATE_VAL_HI 0x00DE

#define VL53L1_RESULT__OSC_CALIBRATE_VAL_LO 0x00DF

#define VL53L1_ANA_CONFIG__POWERDOWN_GO1 0x00E0

#define VL53L1_ANA_CONFIG__REF_BG_CTRL 0x00E1

#define VL53L1_ANA_CONFIG__REGDVDD1V2_CTRL 0x00E2

#define VL53L1_ANA_CONFIG__OSC_SLOW_CTRL 0x00E3

#define VL53L1_TEST_MODE__STATUS 0x00E4

#define VL53L1_FIRMWARE__SYSTEM_STATUS 0x00E5

#define VL53L1_FIRMWARE__MODE_STATUS 0x00E6

#define VL53L1_FIRMWARE__SECONDARY_MODE_STATUS 0x00E7

#define VL53L1_FIRMWARE__CAL_REPEAT_RATE_COUNTER 0x00E8

#define VL53L1_FIRMWARE__CAL_REPEAT_RATE_COUNTER_HI 0x00E8

#define VL53L1_FIRMWARE__CAL_REPEAT_RATE_COUNTER_LO 0x00E9

#define VL53L1_FIRMWARE__HISTOGRAM_BIN 0x00EA

#define VL53L1_GPH__SYSTEM__THRESH_HIGH 0x00EC

#define VL53L1_GPH__SYSTEM__THRESH_HIGH_HI 0x00EC

#define VL53L1_GPH__SYSTEM__THRESH_HIGH_LO 0x00ED

#define VL53L1_GPH__SYSTEM__THRESH_LOW 0x00EE

