stm32duino/VL53L1/src/vl53l1_register_map.h
#define VL53L1_GPH__SYSTEM__THRESH_LOW_HI 0x00EE

#define VL53L1_GPH__SYSTEM__THRESH_LOW_LO 0x00EF

#define VL53L1_GPH__SYSTEM__ENABLE_XTALK_PER_QUADRANT 0x00F0

#define VL53L1_GPH__SPARE_0 0x00F1

#define VL53L1_GPH__SD_CONFIG__WOI_SD0 0x00F2

#define VL53L1_GPH__SD_CONFIG__WOI_SD1 0x00F3

#define VL53L1_GPH__SD_CONFIG__INITIAL_PHASE_SD0 0x00F4

#define VL53L1_GPH__SD_CONFIG__INITIAL_PHASE_SD1 0x00F5

#define VL53L1_GPH__SD_CONFIG__FIRST_ORDER_SELECT 0x00F6

#define VL53L1_GPH__SD_CONFIG__QUANTIFIER 0x00F7

#define VL53L1_GPH__ROI_CONFIG__USER_ROI_CENTRE_SPAD 0x00F8

#define VL53L1_GPH__ROI_CONFIG__USER_ROI_REQUESTED_GLOBAL_XY_SIZE 0x00F9

#define VL53L1_GPH__SYSTEM__SEQUENCE_CONFIG 0x00FA

#define VL53L1_GPH__GPH_ID 0x00FB

#define VL53L1_SYSTEM__INTERRUPT_SET 0x00FC

#define VL53L1_INTERRUPT_MANAGER__ENABLES 0x00FD

#define VL53L1_INTERRUPT_MANAGER__CLEAR 0x00FE

#define VL53L1_INTERRUPT_MANAGER__STATUS 0x00FF

#define VL53L1_MCU_TO_HOST_BANK__WR_ACCESS_EN 0x0100

#define VL53L1_POWER_MANAGEMENT__GO1_RESET_STATUS 0x0101

#define VL53L1_PAD_STARTUP_MODE__VALUE_RO 0x0102

#define VL53L1_PAD_STARTUP_MODE__VALUE_CTRL 0x0103

#define VL53L1_PLL_PERIOD_US 0x0104

#define VL53L1_PLL_PERIOD_US_3 0x0104

#define VL53L1_PLL_PERIOD_US_2 0x0105

#define VL53L1_PLL_PERIOD_US_1 0x0106

#define VL53L1_PLL_PERIOD_US_0 0x0107

#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT 0x0108

#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_3 0x0108

#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_2 0x0109

#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_1 0x010A

#define VL53L1_INTERRUPT_SCHEDULER__DATA_OUT_0 0x010B

#define VL53L1_NVM_BIST__COMPLETE 0x010C

#define VL53L1_NVM_BIST__STATUS 0x010D

#define VL53L1_IDENTIFICATION__MODEL_ID 0x010F

#define VL53L1_IDENTIFICATION__MODULE_TYPE 0x0110

#define VL53L1_IDENTIFICATION__REVISION_ID 0x0111

#define VL53L1_IDENTIFICATION__MODULE_ID 0x0112

#define VL53L1_IDENTIFICATION__MODULE_ID_HI 0x0112

#define VL53L1_IDENTIFICATION__MODULE_ID_LO 0x0113

#define VL53L1_ANA_CONFIG__FAST_OSC__TRIM_MAX 0x0114

#define VL53L1_ANA_CONFIG__FAST_OSC__FREQ_SET 0x0115

#define VL53L1_ANA_CONFIG__VCSEL_TRIM 0x0116

#define VL53L1_ANA_CONFIG__VCSEL_SELION 0x0117

#define VL53L1_ANA_CONFIG__VCSEL_SELION_MAX 0x0118

#define VL53L1_PROTECTED_LASER_SAFETY__LOCK_BIT 0x0119

#define VL53L1_LASER_SAFETY__KEY 0x011A

#define VL53L1_LASER_SAFETY__KEY_RO 0x011B

#define VL53L1_LASER_SAFETY__CLIP 0x011C

#define VL53L1_LASER_SAFETY__MULT 0x011D

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_0 0x011E

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_1 0x011F

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_2 0x0120

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_3 0x0121

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_4 0x0122

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_5 0x0123

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_6 0x0124

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_7 0x0125

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_8 0x0126

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_9 0x0127

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_10 0x0128

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_11 0x0129

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_12 0x012A

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_13 0x012B

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_14 0x012C

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_15 0x012D

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_16 0x012E

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_17 0x012F

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_18 0x0130

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_19 0x0131

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_20 0x0132

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_21 0x0133

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_22 0x0134

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_23 0x0135

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_24 0x0136

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_25 0x0137

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_26 0x0138

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_27 0x0139

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_28 0x013A

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_29 0x013B

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_30 0x013C

#define VL53L1_GLOBAL_CONFIG__SPAD_ENABLES_RTN_31 0x013D

#define VL53L1_ROI_CONFIG__MODE_ROI_CENTRE_SPAD 0x013E

#define VL53L1_ROI_CONFIG__MODE_ROI_XY_SIZE 0x013F

#define VL53L1_GO2_HOST_BANK_ACCESS__OVERRIDE 0x0300

#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLICAND 0x0400

#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLICAND_3 0x0400

#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLICAND_2 0x0401

#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLICAND_1 0x0402

#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLICAND_0 0x0403

#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLIER 0x0404

#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLIER_3 0x0404

#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLIER_2 0x0405

#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLIER_1 0x0406

#define VL53L1_MCU_UTIL_MULTIPLIER__MULTIPLIER_0 0x0407

#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_HI 0x0408

#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_HI_3 0x0408

#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_HI_2 0x0409

#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_HI_1 0x040A

#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_HI_0 0x040B

#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_LO 0x040C

#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_LO_3 0x040C

#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_LO_2 0x040D

#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_LO_1 0x040E

#define VL53L1_MCU_UTIL_MULTIPLIER__PRODUCT_LO_0 0x040F

#define VL53L1_MCU_UTIL_MULTIPLIER__START 0x0410

#define VL53L1_MCU_UTIL_MULTIPLIER__STATUS 0x0411

#define VL53L1_MCU_UTIL_DIVIDER__START 0x0412

#define VL53L1_MCU_UTIL_DIVIDER__STATUS 0x0413

#define VL53L1_MCU_UTIL_DIVIDER__DIVIDEND 0x0414

#define VL53L1_MCU_UTIL_DIVIDER__DIVIDEND_3 0x0414

#define VL53L1_MCU_UTIL_DIVIDER__DIVIDEND_2 0x0415

#define VL53L1_MCU_UTIL_DIVIDER__DIVIDEND_1 0x0416

#define VL53L1_MCU_UTIL_DIVIDER__DIVIDEND_0 0x0417

