stm32duino/VL53L1/src/vl53l1_register_map.h
#define VL53L1_MCU_UTIL_DIVIDER__DIVISOR 0x0418

#define VL53L1_MCU_UTIL_DIVIDER__DIVISOR_3 0x0418

#define VL53L1_MCU_UTIL_DIVIDER__DIVISOR_2 0x0419

#define VL53L1_MCU_UTIL_DIVIDER__DIVISOR_1 0x041A

#define VL53L1_MCU_UTIL_DIVIDER__DIVISOR_0 0x041B

#define VL53L1_MCU_UTIL_DIVIDER__QUOTIENT 0x041C

#define VL53L1_MCU_UTIL_DIVIDER__QUOTIENT_3 0x041C

#define VL53L1_MCU_UTIL_DIVIDER__QUOTIENT_2 0x041D

#define VL53L1_MCU_UTIL_DIVIDER__QUOTIENT_1 0x041E

#define VL53L1_MCU_UTIL_DIVIDER__QUOTIENT_0 0x041F

#define VL53L1_TIMER0__VALUE_IN 0x0420

#define VL53L1_TIMER0__VALUE_IN_3 0x0420

#define VL53L1_TIMER0__VALUE_IN_2 0x0421

#define VL53L1_TIMER0__VALUE_IN_1 0x0422

#define VL53L1_TIMER0__VALUE_IN_0 0x0423

#define VL53L1_TIMER1__VALUE_IN 0x0424

#define VL53L1_TIMER1__VALUE_IN_3 0x0424

#define VL53L1_TIMER1__VALUE_IN_2 0x0425

#define VL53L1_TIMER1__VALUE_IN_1 0x0426

#define VL53L1_TIMER1__VALUE_IN_0 0x0427

#define VL53L1_TIMER0__CTRL 0x0428

#define VL53L1_TIMER1__CTRL 0x0429

#define VL53L1_MCU_GENERAL_PURPOSE__GP_0 0x042C

#define VL53L1_MCU_GENERAL_PURPOSE__GP_1 0x042D

#define VL53L1_MCU_GENERAL_PURPOSE__GP_2 0x042E

#define VL53L1_MCU_GENERAL_PURPOSE__GP_3 0x042F

#define VL53L1_MCU_RANGE_CALC__CONFIG 0x0430

#define VL53L1_MCU_RANGE_CALC__OFFSET_CORRECTED_RANGE 0x0432

#define VL53L1_MCU_RANGE_CALC__OFFSET_CORRECTED_RANGE_HI 0x0432

#define VL53L1_MCU_RANGE_CALC__OFFSET_CORRECTED_RANGE_LO 0x0433

#define VL53L1_MCU_RANGE_CALC__SPARE_4 0x0434

#define VL53L1_MCU_RANGE_CALC__SPARE_4_3 0x0434

#define VL53L1_MCU_RANGE_CALC__SPARE_4_2 0x0435

#define VL53L1_MCU_RANGE_CALC__SPARE_4_1 0x0436

#define VL53L1_MCU_RANGE_CALC__SPARE_4_0 0x0437

#define VL53L1_MCU_RANGE_CALC__AMBIENT_DURATION_PRE_CALC 0x0438

#define VL53L1_MCU_RANGE_CALC__AMBIENT_DURATION_PRE_CALC_HI 0x0438

#define VL53L1_MCU_RANGE_CALC__AMBIENT_DURATION_PRE_CALC_LO 0x0439

#define VL53L1_MCU_RANGE_CALC__ALGO_VCSEL_PERIOD 0x043C

#define VL53L1_MCU_RANGE_CALC__SPARE_5 0x043D

#define VL53L1_MCU_RANGE_CALC__ALGO_TOTAL_PERIODS 0x043E

#define VL53L1_MCU_RANGE_CALC__ALGO_TOTAL_PERIODS_HI 0x043E

#define VL53L1_MCU_RANGE_CALC__ALGO_TOTAL_PERIODS_LO 0x043F

#define VL53L1_MCU_RANGE_CALC__ALGO_ACCUM_PHASE 0x0440

#define VL53L1_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_3 0x0440

#define VL53L1_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_2 0x0441

#define VL53L1_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_1 0x0442

#define VL53L1_MCU_RANGE_CALC__ALGO_ACCUM_PHASE_0 0x0443

#define VL53L1_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS 0x0444

#define VL53L1_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_3 0x0444

#define VL53L1_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_2 0x0445

#define VL53L1_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_1 0x0446

#define VL53L1_MCU_RANGE_CALC__ALGO_SIGNAL_EVENTS_0 0x0447

#define VL53L1_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS 0x0448

#define VL53L1_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_3 0x0448

#define VL53L1_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_2 0x0449

#define VL53L1_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_1 0x044A

#define VL53L1_MCU_RANGE_CALC__ALGO_AMBIENT_EVENTS_0 0x044B

#define VL53L1_MCU_RANGE_CALC__SPARE_6 0x044C

#define VL53L1_MCU_RANGE_CALC__SPARE_6_HI 0x044C

#define VL53L1_MCU_RANGE_CALC__SPARE_6_LO 0x044D

#define VL53L1_MCU_RANGE_CALC__ALGO_ADJUST_VCSEL_PERIOD 0x044E

#define VL53L1_MCU_RANGE_CALC__ALGO_ADJUST_VCSEL_PERIOD_HI 0x044E

#define VL53L1_MCU_RANGE_CALC__ALGO_ADJUST_VCSEL_PERIOD_LO 0x044F

#define VL53L1_MCU_RANGE_CALC__NUM_SPADS 0x0450

#define VL53L1_MCU_RANGE_CALC__NUM_SPADS_HI 0x0450

#define VL53L1_MCU_RANGE_CALC__NUM_SPADS_LO 0x0451

#define VL53L1_MCU_RANGE_CALC__PHASE_OUTPUT 0x0452

#define VL53L1_MCU_RANGE_CALC__PHASE_OUTPUT_HI 0x0452

#define VL53L1_MCU_RANGE_CALC__PHASE_OUTPUT_LO 0x0453

#define VL53L1_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS 0x0454

#define VL53L1_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_3 0x0454

#define VL53L1_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_2 0x0455

#define VL53L1_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_1 0x0456

#define VL53L1_MCU_RANGE_CALC__RATE_PER_SPAD_MCPS_0 0x0457

#define VL53L1_MCU_RANGE_CALC__SPARE_7 0x0458

#define VL53L1_MCU_RANGE_CALC__SPARE_8 0x0459

#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_MCPS 0x045A

#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_MCPS_HI 0x045A

#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_MCPS_LO 0x045B

#define VL53L1_MCU_RANGE_CALC__AVG_SIGNAL_RATE_MCPS 0x045C

#define VL53L1_MCU_RANGE_CALC__AVG_SIGNAL_RATE_MCPS_HI 0x045C

#define VL53L1_MCU_RANGE_CALC__AVG_SIGNAL_RATE_MCPS_LO 0x045D

#define VL53L1_MCU_RANGE_CALC__AMBIENT_RATE_MCPS 0x045E

#define VL53L1_MCU_RANGE_CALC__AMBIENT_RATE_MCPS_HI 0x045E

#define VL53L1_MCU_RANGE_CALC__AMBIENT_RATE_MCPS_LO 0x045F

#define VL53L1_MCU_RANGE_CALC__XTALK 0x0460

#define VL53L1_MCU_RANGE_CALC__XTALK_HI 0x0460

#define VL53L1_MCU_RANGE_CALC__XTALK_LO 0x0461

#define VL53L1_MCU_RANGE_CALC__CALC_STATUS 0x0462

#define VL53L1_MCU_RANGE_CALC__DEBUG 0x0463

#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_XTALK_CORR_MCPS 0x0464

#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_XTALK_CORR_MCPS_HI 0x0464

#define VL53L1_MCU_RANGE_CALC__PEAK_SIGNAL_RATE_XTALK_CORR_MCPS_LO 0x0465

#define VL53L1_MCU_RANGE_CALC__SPARE_0 0x0468

#define VL53L1_MCU_RANGE_CALC__SPARE_1 0x0469

#define VL53L1_MCU_RANGE_CALC__SPARE_2 0x046A

#define VL53L1_MCU_RANGE_CALC__SPARE_3 0x046B

#define VL53L1_PATCH__CTRL 0x0470

#define VL53L1_PATCH__JMP_ENABLES 0x0472

#define VL53L1_PATCH__JMP_ENABLES_HI 0x0472

#define VL53L1_PATCH__JMP_ENABLES_LO 0x0473

#define VL53L1_PATCH__DATA_ENABLES 0x0474

#define VL53L1_PATCH__DATA_ENABLES_HI 0x0474

#define VL53L1_PATCH__DATA_ENABLES_LO 0x0475

#define VL53L1_PATCH__OFFSET_0 0x0476

#define VL53L1_PATCH__OFFSET_0_HI 0x0476

#define VL53L1_PATCH__OFFSET_0_LO 0x0477

#define VL53L1_PATCH__OFFSET_1 0x0478

#define VL53L1_PATCH__OFFSET_1_HI 0x0478

#define VL53L1_PATCH__OFFSET_1_LO 0x0479

#define VL53L1_PATCH__OFFSET_2 0x047A

#define VL53L1_PATCH__OFFSET_2_HI 0x047A

#define VL53L1_PATCH__OFFSET_2_LO 0x047B

#define VL53L1_PATCH__OFFSET_3 0x047C

#define VL53L1_PATCH__OFFSET_3_HI 0x047C

#define VL53L1_PATCH__OFFSET_3_LO 0x047D

