stm32duino/VL53L1/src/vl53l1_register_map.h
#define VL53L1_PATCH__OFFSET_4 0x047E

#define VL53L1_PATCH__OFFSET_4_HI 0x047E

#define VL53L1_PATCH__OFFSET_4_LO 0x047F

#define VL53L1_PATCH__OFFSET_5 0x0480

#define VL53L1_PATCH__OFFSET_5_HI 0x0480

#define VL53L1_PATCH__OFFSET_5_LO 0x0481

#define VL53L1_PATCH__OFFSET_6 0x0482

#define VL53L1_PATCH__OFFSET_6_HI 0x0482

#define VL53L1_PATCH__OFFSET_6_LO 0x0483

#define VL53L1_PATCH__OFFSET_7 0x0484

#define VL53L1_PATCH__OFFSET_7_HI 0x0484

#define VL53L1_PATCH__OFFSET_7_LO 0x0485

#define VL53L1_PATCH__OFFSET_8 0x0486

#define VL53L1_PATCH__OFFSET_8_HI 0x0486

#define VL53L1_PATCH__OFFSET_8_LO 0x0487

#define VL53L1_PATCH__OFFSET_9 0x0488

#define VL53L1_PATCH__OFFSET_9_HI 0x0488

#define VL53L1_PATCH__OFFSET_9_LO 0x0489

#define VL53L1_PATCH__OFFSET_10 0x048A

#define VL53L1_PATCH__OFFSET_10_HI 0x048A

#define VL53L1_PATCH__OFFSET_10_LO 0x048B

#define VL53L1_PATCH__OFFSET_11 0x048C

#define VL53L1_PATCH__OFFSET_11_HI 0x048C

#define VL53L1_PATCH__OFFSET_11_LO 0x048D

#define VL53L1_PATCH__OFFSET_12 0x048E

#define VL53L1_PATCH__OFFSET_12_HI 0x048E

#define VL53L1_PATCH__OFFSET_12_LO 0x048F

#define VL53L1_PATCH__OFFSET_13 0x0490

#define VL53L1_PATCH__OFFSET_13_HI 0x0490

#define VL53L1_PATCH__OFFSET_13_LO 0x0491

#define VL53L1_PATCH__OFFSET_14 0x0492

#define VL53L1_PATCH__OFFSET_14_HI 0x0492

#define VL53L1_PATCH__OFFSET_14_LO 0x0493

#define VL53L1_PATCH__OFFSET_15 0x0494

#define VL53L1_PATCH__OFFSET_15_HI 0x0494

#define VL53L1_PATCH__OFFSET_15_LO 0x0495

#define VL53L1_PATCH__ADDRESS_0 0x0496

#define VL53L1_PATCH__ADDRESS_0_HI 0x0496

#define VL53L1_PATCH__ADDRESS_0_LO 0x0497

#define VL53L1_PATCH__ADDRESS_1 0x0498

#define VL53L1_PATCH__ADDRESS_1_HI 0x0498

#define VL53L1_PATCH__ADDRESS_1_LO 0x0499

#define VL53L1_PATCH__ADDRESS_2 0x049A

#define VL53L1_PATCH__ADDRESS_2_HI 0x049A

#define VL53L1_PATCH__ADDRESS_2_LO 0x049B

#define VL53L1_PATCH__ADDRESS_3 0x049C

#define VL53L1_PATCH__ADDRESS_3_HI 0x049C

#define VL53L1_PATCH__ADDRESS_3_LO 0x049D

#define VL53L1_PATCH__ADDRESS_4 0x049E

#define VL53L1_PATCH__ADDRESS_4_HI 0x049E

#define VL53L1_PATCH__ADDRESS_4_LO 0x049F

#define VL53L1_PATCH__ADDRESS_5 0x04A0

#define VL53L1_PATCH__ADDRESS_5_HI 0x04A0

#define VL53L1_PATCH__ADDRESS_5_LO 0x04A1

#define VL53L1_PATCH__ADDRESS_6 0x04A2

#define VL53L1_PATCH__ADDRESS_6_HI 0x04A2

#define VL53L1_PATCH__ADDRESS_6_LO 0x04A3

#define VL53L1_PATCH__ADDRESS_7 0x04A4

#define VL53L1_PATCH__ADDRESS_7_HI 0x04A4

#define VL53L1_PATCH__ADDRESS_7_LO 0x04A5

#define VL53L1_PATCH__ADDRESS_8 0x04A6

#define VL53L1_PATCH__ADDRESS_8_HI 0x04A6

#define VL53L1_PATCH__ADDRESS_8_LO 0x04A7

#define VL53L1_PATCH__ADDRESS_9 0x04A8

#define VL53L1_PATCH__ADDRESS_9_HI 0x04A8

#define VL53L1_PATCH__ADDRESS_9_LO 0x04A9

#define VL53L1_PATCH__ADDRESS_10 0x04AA

#define VL53L1_PATCH__ADDRESS_10_HI 0x04AA

#define VL53L1_PATCH__ADDRESS_10_LO 0x04AB

#define VL53L1_PATCH__ADDRESS_11 0x04AC

#define VL53L1_PATCH__ADDRESS_11_HI 0x04AC

#define VL53L1_PATCH__ADDRESS_11_LO 0x04AD

#define VL53L1_PATCH__ADDRESS_12 0x04AE

#define VL53L1_PATCH__ADDRESS_12_HI 0x04AE

#define VL53L1_PATCH__ADDRESS_12_LO 0x04AF

#define VL53L1_PATCH__ADDRESS_13 0x04B0

#define VL53L1_PATCH__ADDRESS_13_HI 0x04B0

#define VL53L1_PATCH__ADDRESS_13_LO 0x04B1

#define VL53L1_PATCH__ADDRESS_14 0x04B2

#define VL53L1_PATCH__ADDRESS_14_HI 0x04B2

#define VL53L1_PATCH__ADDRESS_14_LO 0x04B3

#define VL53L1_PATCH__ADDRESS_15 0x04B4

#define VL53L1_PATCH__ADDRESS_15_HI 0x04B4

#define VL53L1_PATCH__ADDRESS_15_LO 0x04B5

#define VL53L1_SPI_ASYNC_MUX__CTRL 0x04C0

#define VL53L1_CLK__CONFIG 0x04C4

#define VL53L1_GPIO_LV_MUX__CTRL 0x04CC

#define VL53L1_GPIO_LV_PAD__CTRL 0x04CD

#define VL53L1_PAD_I2C_LV__CONFIG 0x04D0

#define VL53L1_PAD_STARTUP_MODE__VALUE_RO_GO1 0x04D4

#define VL53L1_HOST_IF__STATUS_GO1 0x04D5

#define VL53L1_MCU_CLK_GATING__CTRL 0x04D8

#define VL53L1_TEST__BIST_ROM_CTRL 0x04E0

#define VL53L1_TEST__BIST_ROM_RESULT 0x04E1

#define VL53L1_TEST__BIST_ROM_MCU_SIG 0x04E2

#define VL53L1_TEST__BIST_ROM_MCU_SIG_HI 0x04E2

#define VL53L1_TEST__BIST_ROM_MCU_SIG_LO 0x04E3

#define VL53L1_TEST__BIST_RAM_CTRL 0x04E4

#define VL53L1_TEST__BIST_RAM_RESULT 0x04E5

#define VL53L1_TEST__TMC 0x04E8

#define VL53L1_TEST__PLL_BIST_MIN_THRESHOLD 0x04F0

#define VL53L1_TEST__PLL_BIST_MIN_THRESHOLD_HI 0x04F0

#define VL53L1_TEST__PLL_BIST_MIN_THRESHOLD_LO 0x04F1

#define VL53L1_TEST__PLL_BIST_MAX_THRESHOLD 0x04F2

#define VL53L1_TEST__PLL_BIST_MAX_THRESHOLD_HI 0x04F2

#define VL53L1_TEST__PLL_BIST_MAX_THRESHOLD_LO 0x04F3

#define VL53L1_TEST__PLL_BIST_COUNT_OUT 0x04F4

#define VL53L1_TEST__PLL_BIST_COUNT_OUT_HI 0x04F4

#define VL53L1_TEST__PLL_BIST_COUNT_OUT_LO 0x04F5

#define VL53L1_TEST__PLL_BIST_GONOGO 0x04F6

#define VL53L1_TEST__PLL_BIST_CTRL 0x04F7

#define VL53L1_RANGING_CORE__DEVICE_ID 0x0680

#define VL53L1_RANGING_CORE__REVISION_ID 0x0681

#define VL53L1_RANGING_CORE__CLK_CTRL1 0x0683

#define VL53L1_RANGING_CORE__CLK_CTRL2 0x0684

#define VL53L1_RANGING_CORE__WOI_1 0x0685

#define VL53L1_RANGING_CORE__WOI_REF_1 0x0686

#define VL53L1_RANGING_CORE__START_RANGING 0x0687

#define VL53L1_RANGING_CORE__LOW_LIMIT_1 0x0690

#define VL53L1_RANGING_CORE__HIGH_LIMIT_1 0x0691

#define VL53L1_RANGING_CORE__LOW_LIMIT_REF_1 0x0692

#define VL53L1_RANGING_CORE__HIGH_LIMIT_REF_1 0x0693

#define VL53L1_RANGING_CORE__QUANTIFIER_1_MSB 0x0694

#define VL53L1_RANGING_CORE__QUANTIFIER_1_LSB 0x0695

#define VL53L1_RANGING_CORE__QUANTIFIER_REF_1_MSB 0x0696

#define VL53L1_RANGING_CORE__QUANTIFIER_REF_1_LSB 0x0697

#define VL53L1_RANGING_CORE__AMBIENT_OFFSET_1_MSB 0x0698

#define VL53L1_RANGING_CORE__AMBIENT_OFFSET_1_LSB 0x0699

#define VL53L1_RANGING_CORE__AMBIENT_OFFSET_REF_1_MSB 0x069A

#define VL53L1_RANGING_CORE__AMBIENT_OFFSET_REF_1_LSB 0x069B

#define VL53L1_RANGING_CORE__FILTER_STRENGTH_1 0x069C

#define VL53L1_RANGING_CORE__FILTER_STRENGTH_REF_1 0x069D

#define VL53L1_RANGING_CORE__SIGNAL_EVENT_LIMIT_1_MSB 0x069E

#define VL53L1_RANGING_CORE__SIGNAL_EVENT_LIMIT_1_LSB 0x069F

