stm32duino/VL53L1/src/vl53l1_register_map.h
#define VL53L1_RANGING_CORE__SIGNAL_EVENT_LIMIT_REF_1_MSB 0x06A0

#define VL53L1_RANGING_CORE__SIGNAL_EVENT_LIMIT_REF_1_LSB 0x06A1

#define VL53L1_RANGING_CORE__TIMEOUT_OVERALL_PERIODS_MSB 0x06A4

#define VL53L1_RANGING_CORE__TIMEOUT_OVERALL_PERIODS_LSB 0x06A5

#define VL53L1_RANGING_CORE__INVERT_HW 0x06A6

#define VL53L1_RANGING_CORE__FORCE_HW 0x06A7

#define VL53L1_RANGING_CORE__STATIC_HW_VALUE 0x06A8

#define VL53L1_RANGING_CORE__FORCE_CONTINUOUS_AMBIENT 0x06A9

#define VL53L1_RANGING_CORE__TEST_PHASE_SELECT_TO_FILTER 0x06AA

#define VL53L1_RANGING_CORE__TEST_PHASE_SELECT_TO_TIMING_GEN 0x06AB

#define VL53L1_RANGING_CORE__INITIAL_PHASE_VALUE_1 0x06AC

#define VL53L1_RANGING_CORE__INITIAL_PHASE_VALUE_REF_1 0x06AD

#define VL53L1_RANGING_CORE__FORCE_UP_IN 0x06AE

#define VL53L1_RANGING_CORE__FORCE_DN_IN 0x06AF

#define VL53L1_RANGING_CORE__STATIC_UP_VALUE_1 0x06B0

#define VL53L1_RANGING_CORE__STATIC_UP_VALUE_REF_1 0x06B1

#define VL53L1_RANGING_CORE__STATIC_DN_VALUE_1 0x06B2

#define VL53L1_RANGING_CORE__STATIC_DN_VALUE_REF_1 0x06B3

#define VL53L1_RANGING_CORE__MONITOR_UP_DN 0x06B4

#define VL53L1_RANGING_CORE__INVERT_UP_DN 0x06B5

#define VL53L1_RANGING_CORE__CPUMP_1 0x06B6

#define VL53L1_RANGING_CORE__CPUMP_2 0x06B7

#define VL53L1_RANGING_CORE__CPUMP_3 0x06B8

#define VL53L1_RANGING_CORE__OSC_1 0x06B9

#define VL53L1_RANGING_CORE__PLL_1 0x06BB

#define VL53L1_RANGING_CORE__PLL_2 0x06BC

#define VL53L1_RANGING_CORE__REFERENCE_1 0x06BD

#define VL53L1_RANGING_CORE__REFERENCE_3 0x06BF

#define VL53L1_RANGING_CORE__REFERENCE_4 0x06C0

#define VL53L1_RANGING_CORE__REFERENCE_5 0x06C1

#define VL53L1_RANGING_CORE__REGAVDD1V2 0x06C3

#define VL53L1_RANGING_CORE__CALIB_1 0x06C4

#define VL53L1_RANGING_CORE__CALIB_2 0x06C5

#define VL53L1_RANGING_CORE__CALIB_3 0x06C6

#define VL53L1_RANGING_CORE__TST_MUX_SEL1 0x06C9

#define VL53L1_RANGING_CORE__TST_MUX_SEL2 0x06CA

#define VL53L1_RANGING_CORE__TST_MUX 0x06CB

#define VL53L1_RANGING_CORE__GPIO_OUT_TESTMUX 0x06CC

#define VL53L1_RANGING_CORE__CUSTOM_FE 0x06CD

#define VL53L1_RANGING_CORE__CUSTOM_FE_2 0x06CE

#define VL53L1_RANGING_CORE__SPAD_READOUT 0x06CF

#define VL53L1_RANGING_CORE__SPAD_READOUT_1 0x06D0

#define VL53L1_RANGING_CORE__SPAD_READOUT_2 0x06D1

#define VL53L1_RANGING_CORE__SPAD_PS 0x06D2

#define VL53L1_RANGING_CORE__LASER_SAFETY_2 0x06D4

#define VL53L1_RANGING_CORE__NVM_CTRL__MODE 0x0780

#define VL53L1_RANGING_CORE__NVM_CTRL__PDN 0x0781

#define VL53L1_RANGING_CORE__NVM_CTRL__PROGN 0x0782

#define VL53L1_RANGING_CORE__NVM_CTRL__READN 0x0783

#define VL53L1_RANGING_CORE__NVM_CTRL__PULSE_WIDTH_MSB 0x0784

#define VL53L1_RANGING_CORE__NVM_CTRL__PULSE_WIDTH_LSB 0x0785

#define VL53L1_RANGING_CORE__NVM_CTRL__HV_RISE_MSB 0x0786

#define VL53L1_RANGING_CORE__NVM_CTRL__HV_RISE_LSB 0x0787

#define VL53L1_RANGING_CORE__NVM_CTRL__HV_FALL_MSB 0x0788

#define VL53L1_RANGING_CORE__NVM_CTRL__HV_FALL_LSB 0x0789

#define VL53L1_RANGING_CORE__NVM_CTRL__TST 0x078A

#define VL53L1_RANGING_CORE__NVM_CTRL__TESTREAD 0x078B

#define VL53L1_RANGING_CORE__NVM_CTRL__DATAIN_MMM 0x078C

#define VL53L1_RANGING_CORE__NVM_CTRL__DATAIN_LMM 0x078D

#define VL53L1_RANGING_CORE__NVM_CTRL__DATAIN_LLM 0x078E

#define VL53L1_RANGING_CORE__NVM_CTRL__DATAIN_LLL 0x078F

#define VL53L1_RANGING_CORE__NVM_CTRL__DATAOUT_MMM 0x0790

#define VL53L1_RANGING_CORE__NVM_CTRL__DATAOUT_LMM 0x0791

#define VL53L1_RANGING_CORE__NVM_CTRL__DATAOUT_LLM 0x0792

#define VL53L1_RANGING_CORE__NVM_CTRL__DATAOUT_LLL 0x0793

#define VL53L1_RANGING_CORE__NVM_CTRL__ADDR 0x0794

#define VL53L1_RANGING_CORE__NVM_CTRL__DATAOUT_ECC 0x0795

#define VL53L1_RANGING_CORE__RET_SPAD_EN_0 0x0796

#define VL53L1_RANGING_CORE__RET_SPAD_EN_1 0x0797

#define VL53L1_RANGING_CORE__RET_SPAD_EN_2 0x0798

#define VL53L1_RANGING_CORE__RET_SPAD_EN_3 0x0799

#define VL53L1_RANGING_CORE__RET_SPAD_EN_4 0x079A

#define VL53L1_RANGING_CORE__RET_SPAD_EN_5 0x079B

#define VL53L1_RANGING_CORE__RET_SPAD_EN_6 0x079C

#define VL53L1_RANGING_CORE__RET_SPAD_EN_7 0x079D

#define VL53L1_RANGING_CORE__RET_SPAD_EN_8 0x079E

#define VL53L1_RANGING_CORE__RET_SPAD_EN_9 0x079F

#define VL53L1_RANGING_CORE__RET_SPAD_EN_10 0x07A0

#define VL53L1_RANGING_CORE__RET_SPAD_EN_11 0x07A1

#define VL53L1_RANGING_CORE__RET_SPAD_EN_12 0x07A2

#define VL53L1_RANGING_CORE__RET_SPAD_EN_13 0x07A3

#define VL53L1_RANGING_CORE__RET_SPAD_EN_14 0x07A4

#define VL53L1_RANGING_CORE__RET_SPAD_EN_15 0x07A5

#define VL53L1_RANGING_CORE__RET_SPAD_EN_16 0x07A6

#define VL53L1_RANGING_CORE__RET_SPAD_EN_17 0x07A7

#define VL53L1_RANGING_CORE__SPAD_SHIFT_EN 0x07BA

#define VL53L1_RANGING_CORE__SPAD_DISABLE_CTRL 0x07BB

#define VL53L1_RANGING_CORE__SPAD_EN_SHIFT_OUT_DEBUG 0x07BC

#define VL53L1_RANGING_CORE__SPI_MODE 0x07BD

#define VL53L1_RANGING_CORE__GPIO_DIR 0x07BE

#define VL53L1_RANGING_CORE__VCSEL_PERIOD 0x0880

#define VL53L1_RANGING_CORE__VCSEL_START 0x0881

#define VL53L1_RANGING_CORE__VCSEL_STOP 0x0882

#define VL53L1_RANGING_CORE__VCSEL_1 0x0885

#define VL53L1_RANGING_CORE__VCSEL_STATUS 0x088D

#define VL53L1_RANGING_CORE__STATUS 0x0980

#define VL53L1_RANGING_CORE__LASER_CONTINUITY_STATE 0x0981

#define VL53L1_RANGING_CORE__RANGE_1_MMM 0x0982

#define VL53L1_RANGING_CORE__RANGE_1_LMM 0x0983

#define VL53L1_RANGING_CORE__RANGE_1_LLM 0x0984

#define VL53L1_RANGING_CORE__RANGE_1_LLL 0x0985

#define VL53L1_RANGING_CORE__RANGE_REF_1_MMM 0x0986

#define VL53L1_RANGING_CORE__RANGE_REF_1_LMM 0x0987

#define VL53L1_RANGING_CORE__RANGE_REF_1_LLM 0x0988

#define VL53L1_RANGING_CORE__RANGE_REF_1_LLL 0x0989

#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_MMM 0x098A

#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_LMM 0x098B

#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_LLM 0x098C

#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_1_LLL 0x098D

#define VL53L1_RANGING_CORE__RANGING_TOTAL_EVENTS_1_MMM 0x098E

#define VL53L1_RANGING_CORE__RANGING_TOTAL_EVENTS_1_LMM 0x098F

#define VL53L1_RANGING_CORE__RANGING_TOTAL_EVENTS_1_LLM 0x0990

#define VL53L1_RANGING_CORE__RANGING_TOTAL_EVENTS_1_LLL 0x0991

#define VL53L1_RANGING_CORE__SIGNAL_TOTAL_EVENTS_1_MMM 0x0992

#define VL53L1_RANGING_CORE__SIGNAL_TOTAL_EVENTS_1_LMM 0x0993

#define VL53L1_RANGING_CORE__SIGNAL_TOTAL_EVENTS_1_LLM 0x0994

#define VL53L1_RANGING_CORE__SIGNAL_TOTAL_EVENTS_1_LLL 0x0995

#define VL53L1_RANGING_CORE__TOTAL_PERIODS_ELAPSED_1_MM 0x0996

#define VL53L1_RANGING_CORE__TOTAL_PERIODS_ELAPSED_1_LM 0x0997

