stm32duino/VL53L1/src/vl53l1_register_map.h
#define VL53L1_RANGING_CORE__TOTAL_PERIODS_ELAPSED_1_LL 0x0998

#define VL53L1_RANGING_CORE__AMBIENT_MISMATCH_MM 0x0999

#define VL53L1_RANGING_CORE__AMBIENT_MISMATCH_LM 0x099A

#define VL53L1_RANGING_CORE__AMBIENT_MISMATCH_LL 0x099B

#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_REF_1_MMM 0x099C

#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_REF_1_LMM 0x099D

#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_REF_1_LLM 0x099E

#define VL53L1_RANGING_CORE__AMBIENT_WINDOW_EVENTS_REF_1_LLL 0x099F

#define VL53L1_RANGING_CORE__RANGING_TOTAL_EVENTS_REF_1_MMM 0x09A0

#define VL53L1_RANGING_CORE__RANGING_TOTAL_EVENTS_REF_1_LMM 0x09A1

#define VL53L1_RANGING_CORE__RANGING_TOTAL_EVENTS_REF_1_LLM 0x09A2

#define VL53L1_RANGING_CORE__RANGING_TOTAL_EVENTS_REF_1_LLL 0x09A3

#define VL53L1_RANGING_CORE__SIGNAL_TOTAL_EVENTS_REF_1_MMM 0x09A4

#define VL53L1_RANGING_CORE__SIGNAL_TOTAL_EVENTS_REF_1_LMM 0x09A5

#define VL53L1_RANGING_CORE__SIGNAL_TOTAL_EVENTS_REF_1_LLM 0x09A6

#define VL53L1_RANGING_CORE__SIGNAL_TOTAL_EVENTS_REF_1_LLL 0x09A7

#define VL53L1_RANGING_CORE__TOTAL_PERIODS_ELAPSED_REF_1_MM 0x09A8

#define VL53L1_RANGING_CORE__TOTAL_PERIODS_ELAPSED_REF_1_LM 0x09A9

#define VL53L1_RANGING_CORE__TOTAL_PERIODS_ELAPSED_REF_1_LL 0x09AA

#define VL53L1_RANGING_CORE__AMBIENT_MISMATCH_REF_MM 0x09AB

#define VL53L1_RANGING_CORE__AMBIENT_MISMATCH_REF_LM 0x09AC

#define VL53L1_RANGING_CORE__AMBIENT_MISMATCH_REF_LL 0x09AD

#define VL53L1_RANGING_CORE__GPIO_CONFIG__A0 0x0A00

#define VL53L1_RANGING_CORE__RESET_CONTROL__A0 0x0A01

#define VL53L1_RANGING_CORE__INTR_MANAGER__A0 0x0A02

#define VL53L1_RANGING_CORE__POWER_FSM_TIME_OSC__A0 0x0A06

#define VL53L1_RANGING_CORE__VCSEL_ATEST__A0 0x0A07

#define VL53L1_RANGING_CORE__VCSEL_PERIOD_CLIPPED__A0 0x0A08

#define VL53L1_RANGING_CORE__VCSEL_STOP_CLIPPED__A0 0x0A09

#define VL53L1_RANGING_CORE__CALIB_2__A0 0x0A0A

#define VL53L1_RANGING_CORE__STOP_CONDITION__A0 0x0A0B

#define VL53L1_RANGING_CORE__STATUS_RESET__A0 0x0A0C

#define VL53L1_RANGING_CORE__READOUT_CFG__A0 0x0A0D

#define VL53L1_RANGING_CORE__WINDOW_SETTING__A0 0x0A0E

#define VL53L1_RANGING_CORE__VCSEL_DELAY__A0 0x0A1A

#define VL53L1_RANGING_CORE__REFERENCE_2__A0 0x0A1B

#define VL53L1_RANGING_CORE__REGAVDD1V2__A0 0x0A1D

#define VL53L1_RANGING_CORE__TST_MUX__A0 0x0A1F

#define VL53L1_RANGING_CORE__CUSTOM_FE_2__A0 0x0A20

#define VL53L1_RANGING_CORE__SPAD_READOUT__A0 0x0A21

#define VL53L1_RANGING_CORE__CPUMP_1__A0 0x0A22

#define VL53L1_RANGING_CORE__SPARE_REGISTER__A0 0x0A23

#define VL53L1_RANGING_CORE__VCSEL_CONT_STAGE5_BYPASS__A0 0x0A24

#define VL53L1_RANGING_CORE__RET_SPAD_EN_18 0x0A25

#define VL53L1_RANGING_CORE__RET_SPAD_EN_19 0x0A26

#define VL53L1_RANGING_CORE__RET_SPAD_EN_20 0x0A27

#define VL53L1_RANGING_CORE__RET_SPAD_EN_21 0x0A28

#define VL53L1_RANGING_CORE__RET_SPAD_EN_22 0x0A29

#define VL53L1_RANGING_CORE__RET_SPAD_EN_23 0x0A2A

#define VL53L1_RANGING_CORE__RET_SPAD_EN_24 0x0A2B

#define VL53L1_RANGING_CORE__RET_SPAD_EN_25 0x0A2C

#define VL53L1_RANGING_CORE__RET_SPAD_EN_26 0x0A2D

#define VL53L1_RANGING_CORE__RET_SPAD_EN_27 0x0A2E

#define VL53L1_RANGING_CORE__RET_SPAD_EN_28 0x0A2F

#define VL53L1_RANGING_CORE__RET_SPAD_EN_29 0x0A30

#define VL53L1_RANGING_CORE__RET_SPAD_EN_30 0x0A31

#define VL53L1_RANGING_CORE__RET_SPAD_EN_31 0x0A32

#define VL53L1_RANGING_CORE__REF_SPAD_EN_0__EWOK 0x0A33

#define VL53L1_RANGING_CORE__REF_SPAD_EN_1__EWOK 0x0A34

#define VL53L1_RANGING_CORE__REF_SPAD_EN_2__EWOK 0x0A35

#define VL53L1_RANGING_CORE__REF_SPAD_EN_3__EWOK 0x0A36

#define VL53L1_RANGING_CORE__REF_SPAD_EN_4__EWOK 0x0A37

#define VL53L1_RANGING_CORE__REF_SPAD_EN_5__EWOK 0x0A38

#define VL53L1_RANGING_CORE__REF_EN_START_SELECT 0x0A39

#define VL53L1_RANGING_CORE__REGDVDD1V2_ATEST__EWOK 0x0A41

#define VL53L1_SOFT_RESET_GO1 0x0B00

#define VL53L1_PRIVATE__PATCH_BASE_ADDR_RSLV 0x0E00

#define VL53L1_PREV_SHADOW_RESULT__INTERRUPT_STATUS 0x0ED0

#define VL53L1_PREV_SHADOW_RESULT__RANGE_STATUS 0x0ED1

#define VL53L1_PREV_SHADOW_RESULT__REPORT_STATUS 0x0ED2

#define VL53L1_PREV_SHADOW_RESULT__STREAM_COUNT 0x0ED3

#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0 0x0ED4

#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x0ED4

#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x0ED5

#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0 0x0ED6

#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x0ED6

#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD0_LO 0x0ED7

#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0 0x0ED8

#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_HI 0x0ED8

#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD0_LO 0x0ED9

#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD0 0x0EDA

#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD0_HI 0x0EDA

#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD0_LO 0x0EDB

#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD0 0x0EDC

#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD0_HI 0x0EDC

#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD0_LO 0x0EDD

#define VL53L1_PREV_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0 0x0EDE

#define VL53L1_PREV__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_HI 0x0EDE

#define VL53L1_PREV__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD0_LO 0x0EDF

#define VL53L1_PREV__PEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0 0x0EE0

#define VL53L1_PPEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_HI 0x0EE0

#define VL53L1_PPEAK_SIGNAL_COUNT_RATE_CROSSTALK_CORRECTED_MCPS_SD0_LO 0x0EE1

#define VL53L1_PREV_SHADOW_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0 0x0EE2

#define VL53L1_PREV_SHADOW_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x0EE2

#define VL53L1_PREV_SHADOW_RESULT__MM_INNER_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x0EE3

#define VL53L1_PREV_SHADOW_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0 0x0EE4

#define VL53L1_PREV_SHADOW_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_HI 0x0EE4

#define VL53L1_PREV_SHADOW_RESULT__MM_OUTER_ACTUAL_EFFECTIVE_SPADS_SD0_LO 0x0EE5

#define VL53L1_PREV_SHADOW_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0 0x0EE6

#define VL53L1_PREV_SHADOW_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_HI 0x0EE6

