stm32duino/VL53L1/src/vl53l1_register_map.h
#define VL53L1_PREV_SHADOW_RESULT__AVG_SIGNAL_COUNT_RATE_MCPS_SD0_LO 0x0EE7

#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1 0x0EE8

#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_HI 0x0EE8

#define VL53L1_PREV_SHADOW_RESULT__DSS_ACTUAL_EFFECTIVE_SPADS_SD1_LO 0x0EE9

#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1 0x0EEA

#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_HI 0x0EEA

#define VL53L1_PREV_SHADOW_RESULT__PEAK_SIGNAL_COUNT_RATE_MCPS_SD1_LO 0x0EEB

#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1 0x0EEC

#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_HI 0x0EEC

#define VL53L1_PREV_SHADOW_RESULT__AMBIENT_COUNT_RATE_MCPS_SD1_LO 0x0EED

#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD1 0x0EEE

#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD1_HI 0x0EEE

#define VL53L1_PREV_SHADOW_RESULT__SIGMA_SD1_LO 0x0EEF

#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD1 0x0EF0

#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD1_HI 0x0EF0

#define VL53L1_PREV_SHADOW_RESULT__PHASE_SD1_LO 0x0EF1

#define VL53L1_PREV_SHADOW_RESULT__FINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1 0x0EF2

#define VL53L1_PFINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_HI 0x0EF2

#define VL53L1_PFINAL_CROSSTALK_CORRECTED_RANGE_MM_SD1_LO 0x0EF3

#define VL53L1_PREV_SHADOW_RESULT__SPARE_0_SD1 0x0EF4

#define VL53L1_PREV_SHADOW_RESULT__SPARE_0_SD1_HI 0x0EF4

#define VL53L1_PREV_SHADOW_RESULT__SPARE_0_SD1_LO 0x0EF5

#define VL53L1_PREV_SHADOW_RESULT__SPARE_1_SD1 0x0EF6

#define VL53L1_PREV_SHADOW_RESULT__SPARE_1_SD1_HI 0x0EF6

#define VL53L1_PREV_SHADOW_RESULT__SPARE_1_SD1_LO 0x0EF7

#define VL53L1_PREV_SHADOW_RESULT__SPARE_2_SD1 0x0EF8

#define VL53L1_PREV_SHADOW_RESULT__SPARE_2_SD1_HI 0x0EF8

#define VL53L1_PREV_SHADOW_RESULT__SPARE_2_SD1_LO 0x0EF9

#define VL53L1_PREV_SHADOW_RESULT__SPARE_3_SD1 0x0EFA

#define VL53L1_PREV_SHADOW_RESULT__SPARE_3_SD1_HI 0x0EFA

#define VL53L1_PREV_SHADOW_RESULT__SPARE_3_SD1_LO 0x0EFB

#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0 0x0EFC

#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_3 0x0EFC

#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_2 0x0EFD

#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_1 0x0EFE

#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD0_0 0x0EFF

#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0 0x0F00

#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_3 0x0F00

#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_2 0x0F01

#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_1 0x0F02

#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD0_0 0x0F03

#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0 0x0F04

#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_3 0x0F04

#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_2 0x0F05

#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_1 0x0F06

#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD0_0 0x0F07

#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0 0x0F08

#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_3 0x0F08

#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_2 0x0F09

#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_1 0x0F0A

#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD0_0 0x0F0B

#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1 0x0F0C

#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_3 0x0F0C

#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_2 0x0F0D

#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_1 0x0F0E

#define VL53L1_PREV_SHADOW_RESULT_CORE__AMBIENT_WINDOW_EVENTS_SD1_0 0x0F0F

#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1 0x0F10

#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_3 0x0F10

#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_2 0x0F11

#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_1 0x0F12

#define VL53L1_PREV_SHADOW_RESULT_CORE__RANGING_TOTAL_EVENTS_SD1_0 0x0F13

#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1 0x0F14

#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_3 0x0F14

#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_2 0x0F15

#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_1 0x0F16

#define VL53L1_PREV_SHADOW_RESULT_CORE__SIGNAL_TOTAL_EVENTS_SD1_0 0x0F17

#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1 0x0F18

#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_3 0x0F18

#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_2 0x0F19

#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_1 0x0F1A

#define VL53L1_PREV_SHADOW_RESULT_CORE__TOTAL_PERIODS_ELAPSED_SD1_0 0x0F1B

#define VL53L1_PREV_SHADOW_RESULT_CORE__SPARE_0 0x0F1C

#define VL53L1_RESULT__DEBUG_STATUS 0x0F20

#define VL53L1_RESULT__DEBUG_STAGE 0x0F21

#define VL53L1_GPH__SYSTEM__THRESH_RATE_HIGH 0x0F24

#define VL53L1_GPH__SYSTEM__THRESH_RATE_HIGH_HI 0x0F24

#define VL53L1_GPH__SYSTEM__THRESH_RATE_HIGH_LO 0x0F25

#define VL53L1_GPH__SYSTEM__THRESH_RATE_LOW 0x0F26

#define VL53L1_GPH__SYSTEM__THRESH_RATE_LOW_HI 0x0F26

#define VL53L1_GPH__SYSTEM__THRESH_RATE_LOW_LO 0x0F27

#define VL53L1_GPH__SYSTEM__INTERRUPT_CONFIG_GPIO 0x0F28

#define VL53L1_GPH__DSS_CONFIG__ROI_MODE_CONTROL 0x0F2F

#define VL53L1_GPH__DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT 0x0F30

#define VL53L1_GPH__DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_HI 0x0F30

#define VL53L1_GPH__DSS_CONFIG__MANUAL_EFFECTIVE_SPADS_SELECT_LO 0x0F31

#define VL53L1_GPH__DSS_CONFIG__MANUAL_BLOCK_SELECT 0x0F32

#define VL53L1_GPH__DSS_CONFIG__MAX_SPADS_LIMIT 0x0F33

#define VL53L1_GPH__DSS_CONFIG__MIN_SPADS_LIMIT 0x0F34

#define VL53L1_GPH__MM_CONFIG__TIMEOUT_MACROP_A_HI 0x0F36

#define VL53L1_GPH__MM_CONFIG__TIMEOUT_MACROP_A_LO 0x0F37

#define VL53L1_GPH__MM_CONFIG__TIMEOUT_MACROP_B_HI 0x0F38

